# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn' # Needed to install fonts

# Development
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'homebrew/cask-versions/firefox-beta'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iterm2'
cask 'notion'
cask 'phpstorm'
cask 'raycast'
cask 'scroll-reverser'
cask 'sensiblesidebuttons'
cask 'slack'
cask 'spectacle'
cask 'sublime-merge'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-hack'

# Mac App Store
mas 'Lungo', id: 1263070803
mas 'Contrast', id: 1254981365
mas 'Gifski', id: 1351639930
mas 'One Thing', id: 1604176982
mas 'HEIC Converter', id: 1294126402
