# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'adr-tools'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'glab'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'lazygit'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'prettyping'
brew 'svn' # Needed to install fonts
brew 'tldr'

# Development
brew 'mysql'

# Apps
cask 'arc'
cask '1password'
cask 'bitwarden'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'homebrew/cask-versions/firefox-beta'
cask 'google-chrome'
cask 'gpg-suite'
cask 'herd'
cask 'iterm2'
cask 'karabiner-elements'
cask 'microsoft-teams'
cask 'notion'
cask 'raycast'
cask 'rectangle'
cask 'scroll-reverser'
cask 'sensiblesidebuttons'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-gudea'
cask 'font-open-sans'
cask 'font-shadows-into-light'

# Mac App Store
mas 'Lungo', id: 1263070803
mas 'Contrast', id: 1254981365
mas 'Gifski', id: 1351639930
mas 'One Thing', id: 1604176982
mas 'HEIC Converter', id: 1294126402
mas 'Dato', id: 1470584107
mas 'Tailscale', id: 1475387142
mas 'Telegram', id: 747648890
mas 'Velja', id: 1607635845
mas 'Hyperduck', id: 6444667067
